#pragma once
// for towns
//#define countTowns 21

#define speed 60.0 //km/h
#define kmhToMM (3600.0 / speed) // перевод км в секунды с учетом средней скорости

// for cars
//#define maxCapacity 30
long long maxCountCar =  3;
double optimalRadius = 0.37;
//#define countFiles 1

/*
#define FILES \
	char *mfiles[] = { \
		"/Users/ivandruzkov/project/LKH0/20(20_задач)/20200925_093755.csv", \
		"/Users/ivandruzkov/project/LKH0/20(20_задач)/20201027_214904.csv", \
		"20(20_задач)/20201028_202211.csv", \
		"20(20_задач)//20201029_201947.csv", \
		"20(20_задач)//20201105_201910.csv", \
		"20(20_задач)//20201109_190333.csv", \
		"20(20_задач)//20201110_211510.csv", \
		"20(20_задач)//20201110_212146.csv", \
		"20(20_задач)//20201117_214239.csv", \
		"20(20_задач)//20201127_184250.csv", \
		"20(20_задач)//20201128_220622.csv", \
		"20(20_задач)//20201203_215226.csv", \
		"20(20_задач)//20201204_205445.csv", \
		"20(20_задач)//20201209_152236.csv", \
		"20(20_задач)//20201214_185310.csv", \
		"20(20_задач)//20201007_185322.csv", \
		"20(20_задач)//20201023_203450.csv" \
	}*/

// for lkh
#define ALGFOR(i) i < countUpdate

#ifdef DEBUG
#define DEBUG_TEST 1
#else
#define DEBUG_TEST 0
#endif

#include <string.h>

#define __FILENAME__ (strrchr(__FILE__, '/') ? strrchr(__FILE__, '/') + 1 : __FILE__)

#define DEBUG_LOG(...) \
	do { \
		if (DEBUG) \
			printf("[%s]:%d:%s(): ", __FILENAME__, __LINE__, __func__); \
			printf(__VA_ARGS__); \
	} while (0)

//(timeUpdate < ((clock() - runtime) / CLOCKS_PER_SEC))

// long long countTasks = 500;
// long long countUpdate = 100;
//#define timeUpdate 1500000
//lkh3optTw
#define LKH lkh2opt
char fileout[] = "LKH_2opt_cvrp_result_100.txt";
// int maxCapacity = 50;
//for sa
long double tmax = 1000;
long double tmin = 500;

//parameters-bin
long long countTowns = 101;
#define countFilesBin 18

#define pathSavingTowns "bin-towns"
#define noteFile "test"

#define RESET   "\033[0m"
#define RED     "\033[1;31m"
#define BLACK   "\033[37;40m"
#define YELLOW  "\033[1;33m"
#define WHITE   "\033[37;46m"


#define FILESbin \
	char *mfiles[] = { \
	"100(20 задач)/20201020_182616.csv", \
	"100(20 задач)/20201021_185504.csv", \
	"100(20 задач)/20201111_223641.csv", \
	"100(20 задач)/20201118_223519.csv", \
	"100(20 задач)/20201119_230826.csv", \
	"100(20 задач)/20201123_210620.csv", \
	"100(20 задач)/20201125_032739.csv", \
	"100(20 задач)/20201125_225552.csv", \
	"100(20 задач)/20201126_190637.csv", \
	"100(20 задач)/20201130_210949.csv", \
	"100(20 задач)/20201201_165823.csv", \
	"100(20 задач)/20201202_191224.csv", \
	"100(20 задач)/20201208_202137.csv", \
	"100(20 задач)/20201215_221946.csv", \
	"100(20 задач)/20201216_183747.csv", \
	"100(20 задач)/20201217_144624.csv", \
	"100(20 задач)/20201224_012524.csv", \
	"100(20 задач)/20210105_235706.csv" \
	}

	// "20(20 задач)/20200925_093755.csv", \
	// "20(20 задач)/20201101_150113.csv", \
	// "20(20 задач)/20201115_132354.csv", \
	// "20(20 задач)/20201116_232344.csv", \
	// "20(20 задач)/20201224_222701.csv", \
	// "20(20 задач)/20201225_204810.csv", \
	// "20(20 задач)/20201228_230627.csv", \
	// "20(20 задач)/20200927_100114.csv", \
	// "20(20 задач)/20200928_114457.csv", \
	// "20(20 задач)/20200930_163005.csv", \
	// "20(20 задач)/20201005_160200.csv", \
	// "20(20 задач)/20201008_165020.csv", \
	// "20(20 задач)/20201014_154416.csv", \
	// "20(20 задач)/20201025_141430.csv", \
	// "20(20 задач)/20201025_142105.csv" \
	// "50(20 задач)/20201203_215226.csv", \
	// "50(20 задач)/20201204_205445.csv", \
	// "50(20 задач)/20201209_152236.csv", \
	// "50(20 задач)/20201214_185310.csv", \
	// "50(20 задач)/20201007_185322.csv", \
	// "50(20 задач)/20201023_203450.csv", \
	// "50(20 задач)/20201026_211708.csv", \
	// "50(20 задач)/20201027_214904.csv", \
	// "50(20 задач)/20201028_202211.csv", \
	// "50(20 задач)/20201029_201947.csv", \
	// "50(20 задач)/20201105_201910.csv", \
	// "50(20 задач)/20201109_190333.csv", \
	// "50(20 задач)/20201110_211510.csv", \
	// "50(20 задач)/20201110_212146.csv", \
	// "50(20 задач)/20201117_214239.csv", \
	// "50(20 задач)/20201127_184250.csv", \
	// "50(20 задач)/20201128_220622.csv" \
	// "100(20 задач)/20201020_182616.csv", \
	// "100(20 задач)/20201021_185504.csv", \
	// "100(20 задач)/20201111_223641.csv", \
	// "100(20 задач)/20201118_223519.csv", \
	// "100(20 задач)/20201119_230826.csv", \
	// "100(20 задач)/20201123_210620.csv", \
	// "100(20 задач)/20201125_032739.csv", \
	// "100(20 задач)/20201125_225552.csv", \
	// "100(20 задач)/20201126_190637.csv", \
	// "100(20 задач)/20201130_210949.csv", \
	// "100(20 задач)/20201201_165823.csv", \
	// "100(20 задач)/20201202_191224.csv", \
	// "100(20 задач)/20201208_202137.csv", \
	// "100(20 задач)/20201215_221946.csv", \
	// "100(20 задач)/20201216_183747.csv", \
	// "100(20 задач)/20201217_144624.csv", \
	// "100(20 задач)/20201224_012524.csv", \
	// "100(20 задач)/20210105_235706.csv" \